### E. Aggregation Methods

In [1]:
import pandas as pd
import numpy as np

In [13]:
df4 = pd.DataFrame({'Product Name':['Shirt','Boot','Bag', 'shoe'], 
              'Order Number':[45,56,64, 38], 
              'Total Quantity':[10,5,9, 10]}, 
              columns = ['Product Name', 'Order Number', 'Total Quantity'])

In [14]:
df4

  Product Name  Order Number  Total Quantity
0        Shirt            45              10
1         Boot            56               5
2          Bag            64               9
3         shoe            38              10

In [15]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Product Name    4 non-null      object
 1   Order Number    4 non-null      int64
 2   Total Quantity  4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [16]:
df4.columns

Index(['Product Name', 'Order Number', 'Total Quantity'], dtype='object')

In [17]:
df4.head(1)

  Product Name  Order Number  Total Quantity
0        Shirt            45              10

In [18]:
df4.shape

(4, 3)

In [19]:
type(df4.shape)

tuple

In [20]:
df4['Product Name']

0    Shirt
1     Boot
2      Bag
3     shoe
Name: Product Name, dtype: object

In [21]:
df4['Order Number']

0    45
1    56
2    64
3    38
Name: Order Number, dtype: int64

In [22]:
df4['Total Quantity']

0    10
1     5
2     9
3    10
Name: Total Quantity, dtype: int64

In [23]:
df4.describe()

       Order Number  Total Quantity
count      4.000000        4.000000
mean      50.750000        8.500000
std       11.528949        2.380476
min       38.000000        5.000000
25%       43.250000        8.000000
50%       50.500000        9.500000
75%       58.000000       10.000000
max       64.000000       10.000000

In [24]:

df4.describe().transpose()

                count   mean        std   min    25%   50%   75%   max
Order Number      4.0  50.75  11.528949  38.0  43.25  50.5  58.0  64.0
Total Quantity    4.0   8.50   2.380476   5.0   8.00   9.5  10.0  10.0

In [25]:
df4

  Product Name  Order Number  Total Quantity
0        Shirt            45              10
1         Boot            56               5
2          Bag            64               9
3         shoe            38              10

In [26]:
# Mode of the dataframe
# Mode is the most recurring values
df4['Total Quantity'].mode()

0    10
dtype: int64

In [27]:
# The maximum value
df4['Total Quantity'].max()

10

In [28]:
# The minimum value

df4['Total Quantity'].min()

5

In [29]:
# The mean

df4['Total Quantity'].mean()

8.5

In [30]:
# The median value in a dataframe

df4['Total Quantity'].median()

9.5

In [31]:
df4

  Product Name  Order Number  Total Quantity
0        Shirt            45              10
1         Boot            56               5
2          Bag            64               9
3         shoe            38              10

In [32]:
# Standard deviation

df4['Total Quantity'].std()

2.3804761428476167

In [34]:
import math
math.sqrt(((10-8.5)**2 + (8.5-5)**2 + (9-8.5)**2 + (10-8.5)**2)/(4-1))

2.3804761428476167

In [37]:
# Variance 

df4['Total Quantity'].var()

5.666666666666667

In [36]:
# Sum of all values in a column

df4['Total Quantity'].sum()

34

In [39]:
# Product of all values in dataframe

df4['Total Quantity'].prod()

4500